weblife_stores/app/controllers/admins_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 5) LIMIT 1
---
	def users_list
    @users=User.find :all,:conditions=>["is_admin=0"]