weblife_stores/app/controllers/bulk_uploads_controller.rb

  def upload_file

      #params[:page] condition is added due to jump to # feature
      if request.post? and params[:page].blank?
        @products_array,session[:local_file_path]=Product.parse_csv(params[:file],current_user,true)
      end
      @products_array,session[:local_file_path]=Product.parse_csv(session[:local_file_path],current_user,false) if !params[:page].blank? && !session[:local_file_path].blank?
---
SELECT `products`.id FROM `products` WHERE (`products`.`product_id` = BINARY 'first id') LIMIT 1

  def revert_products
      products=Product.find(:all,:conditions=>["user_id=?",current_user.id],:limit=>params[:id],:order=>"id DESC")
      products.each do |product|
        product.destroy
---
SELECT * FROM `products` WHERE (user_id=1) ORDER BY id DESC LIMIT 14
DELETE FROM `products` WHERE `id` = 42