weblife_stores/app/controllers/users_controller.rb

  def index
    @users=User.find :all
---
SELECT * FROM `users` WHERE (`users`.`id` = 5) LIMIT 1

  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 5) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-11-27 20:22:53', `login` = 'faisale', `state` = 'active' WHERE `id` = 4

  def login_from_admin
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 5) LIMIT 1

  def destroy
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 6)

    def find_user
      @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 5) LIMIT 1